<h1>Kurzanleitung:</h1>

Das Tool hat unten ein durch Reiter dreigeteiltes Fenster zur Aufnahme von Datensatzen. 
<ul>
<li>In das Fenster mit dem Reiter "Alter Datensatz" kann der alte, zu bearbeitende Datensatz im Pica- oder Pica+-Format eingef&uuml;gt werden. 
<li>Angereicherte oder selbsterzeugt Datens&auml;tze werden in den Reitern "Neu Pica" und "Neu Aleph" ausgegeben</li>
<li>Der Datensatz in "Neu Pica" kann durch Eingaben &uuml;ber die Tastatur weiterverarbeitet werden. Beim Verlassen des Fensters (Klicken anderswohin, "Focus lost") wird der ver&auml;nderte Datensatz analysisert und entweder aktualisiert oder aber die &Auml;nderung im Fehlerfalle zur&uuml;ckgewiesen.</li>
</ul>
Vorgehensweise bei Aufarbeitung von alten Datens&auml;tzen:
<ul>
<li>In der IBW in den Korrekturmodus gehen</li>
<li>Den Datensatz vollst&auml;ndig markieren (STRG-A) und in die Zwischenablage &uuml;bernehmen (STRG-C)</li>
<li>Alten Datensatz in das linke Teilfenster des Tools einf&uuml;gen (STRG-V)</li>
<li>"Bearbeiten / Neu ..." dr&uuml;cken, ein Vorschlag f&uuml;r den neuen Datensatz erscheint rechts.</li>
<li>Diesen Vorschlag weiterbearbeiten durch Einf&uuml;gen von weiteren (alternativen) Titelformulierungen, Gattung, Instrument und Komponist.</li>
<li>Die Expansionen durch Entfernen des H&auml;kchens bei "Expansion" entfernen.</li>
<li>Neuen Datensatz markieren (STRG-A) und in Zwischenablage &uuml;bernehmen (STRG-C)</li>
<li>In die WinIBW einf&uuml;gen (STRG-V). Der alte Datensatz wird damit &uuml;berschrieben.</li>
<li>Den Datensatz-Vorschlag nach den &uuml;blichen Regeln weiterbearbeiten.</li>
</ul>
Vorgehensweise bei der Eingabe von neuen Datens&auml;tzen:
<ul>
<li>"Bearbeiten / Neu ..." dr&uuml;cken, ein Basistemplate f&uuml;r den neuen Datensatz erscheint rechts.</li>
<li>Diesen Vorschlag weiterbearbeiten durch Einf&uuml;gen von alternativen Titelformulierungen, Gattung, Instrument und Komponist.</li>
<li> WinIBW:
		<ul>
        <li>Die Expansionen durch Entfernen des H&auml;kchens bei "Expansion" entfernen.</li>
        <li>Neuen Datensatz markieren (STRG-A) und in Zwischenablage &uuml;bernehmen (STRG-C)</li>
        <li>In die WinIBW einf&uuml;gen (STRG-V). Der alte Datensatz wird damit &uuml;berschrieben.</li>
        <li>Den Datensatz-Vorschlag nach den &uuml;blichen Regeln weiterbearbeiten.</li>
		</ul>
    Aleph:
		<ul>
        <li>Die Daten aus dem Tab "Neu Aleph" durch Copy and Paste in das Aleph-Template &uuml;bernehmen. Dabei kann zu didaktischen Zwecken die Option "Felder und Unterfelder explizit" gew&auml;hlt werden. Dann m&uuml;ssen allerdings alle Unterfelder einzeln &uuml;bernommen werden. Besser ist es, diese Option auszuschalten, da dann das Inhalt des gesamten Fensters mit STRG-A und STRG-C auf einnal kopiert und eingef&uuml;gt werden kann.</li>
		</ul>
</li>
</ul>
Synthese von Musiktiteln: 
<ul>
 <li>Erstellte Musiktitel werden durch Klick auf "Einf&uuml;gen ..." in den Datensatz eingef&uuml;gt.</li>
 <li>durch das Dropdown-Men&uuml; "1XX / 4XX" wird festgelegt, ob der neue Titel Vorzugsbenennung oder Alternativbenennung sein soll.</li>
 <li>Zu Beginn muss ein Formal- oder Individualsachtitel angelegt werden</li>
 <li>In diesen k&ouml;nnen nun weitere unterscheidende Angaben (Gattung, Instrument, Opus ...) eingef&uuml;gt werden</li>
 <li>Liegen Werkteile (mit nat&uuml;rlich eigenem Titel) vor, so k&ouml;nnen diese &uuml;ber "Neues Werk / Neuen Werkteil hinzuf&uuml;gen" hinzugef&uuml;gt werden</li>
 <li>Auch der letzte eingef&uuml;gte Werkteil kann mit unterscheidenden Angaben angereichert werden</li>
 <li>Zuletzt kann noch eine Fassung dieses Werkes/Teiles erzeugt werden</li>
 <li>Eine leere Fassung muss, eine Fassung mit Fassungsphrase kann mit unterscheidenden Angaben angereichert werden</li>
 <li>Alle Aktionen k&ouml;nnen mit "R&uuml;ckg&auml;ngig" zur&uuml;ckgenommen werden (Undo-Funktionalit&auml;t)</li>
 <li>In den Feldern "RAK-Darstellung", "RSWK-Darstellung" und "GND-Darstellung" wird der bisher erzeugte Titel im entsprechenden Format angezeigt</li>
 <li>Im Feld "strukturiert" sehen Sie eine m&ouml;glichst weitgehende Analyse der eingegebenen Daten. Alle diese Daten werden zur Gewinnung der 3XX-Felder in der GND herangezogen.</li>
</ul>
Weitere Bedienelemente:
<ul>
<li>Im Fehlerfalle kann die letzte Fehlermeldung &uuml;ber das Men&uuml; ? -> "Zeige Fehler" abgefragt werden.</li>
<li>Die Fehlermeldung bitte markieren, kopieren und an c.baumann@dnb.de schicken</li>
</ul>

<h2>Wie geht das Tool bei der Bearbeitung alter Datens&auml;tze vor?</h2>

<h3>A. Anreichern des Datensatzes</h3>
<ul>
<li>Es erg&auml;nzt L&auml;ndercodes, sofern es den Komponisten "kennt".</li>
<li>Es erg&auml;nzt GND-Systematik 14.4p.</li>
<li>Es "r&auml;t" die Quelle nach den &uuml;blichen Werkverzeichnissen.</li>
<li>Es erg&auml;nzt die redaktionelle Bemerkung "VPe" (Vollst&auml;ngiger Satz Pr&uuml;fung erfolgt).</li>
</ul>
<h3>B. Verarbeitung der 130</h3>
<ul>
<li>Es transformiert die 130 in die GND-Unterfelder</li>
<li>Es erschlie&szlig;t aus den in der 130 verf&uuml;gbaren Informationen die Felder 380, 382, 383, 384, 430, 548 und 550</li>
<li>Der Entit&auml;tencode wird auf wim oder wif gesetzt.</li>
</ul>
<h3>C. Verarbeitung der 430</h3>
<ul>
<li>In der Regel wird das 430-Feld in alle erlaubten Unterfelder zerlegt.</li>
<li>Davon ausgenommen sind die mit "R:EST vor RAK-M 2003" markierten 430-Felder. Hier werden nur die Unterfelder $p und $s erzeugt.</li>
<li>F&uuml;r die Zwecke der DNB wird eine Portal-430 erzeugt, sofern ein Werkteil vorliegt. Diese 430 enth&auml;lt die Deskriptionszeichen nach RAK-Musik.</li>
</ul>

